ASoftTech/mbed.visualmicro.platform/Micro Platforms/mbed_os_52/hardware/arm-unsupported/boards.txt
# Used for custom targets
# where we need to set the target board as part of the local mbed config
mbed_os_unsupp_generic.name=Mbed Generic
mbed_os_unsupp_generic.build.mcu=
mbed_os_unsupp_generic.upload.tool=openocd
mbed_os_unsupp_generic.debug.tool=gdb

mbed_os_unsupp_arch_ble.name=ARCH_BLE
mbed_os_unsupp_arch_ble.build.mcu=-m ARCH_BLE
mbed_os_unsupp_arch_ble.upload.tool=openocd
mbed_os_unsupp_arch_ble.debug.tool=gdb

mbed_os_unsupp_arch_ble_boot.name=ARCH_BLE_BOOT
mbed_os_unsupp_arch_ble_boot.build.mcu=-m ARCH_BLE_BOOT
mbed_os_unsupp_arch_ble_boot.upload.tool=openocd
mbed_os_unsupp_arch_ble_boot.debug.tool=gdb

mbed_os_unsupp_arch_ble_ota.name=ARCH_BLE_OTA
mbed_os_unsupp_arch_ble_ota.build.mcu=-m ARCH_BLE_OTA
mbed_os_unsupp_arch_ble_ota.upload.tool=openocd
mbed_os_unsupp_arch_ble_ota.debug.tool=gdb

mbed_os_unsupp_arch_gprs.name=ARCH_GPRS
mbed_os_unsupp_arch_gprs.build.mcu=-m ARCH_GPRS
mbed_os_unsupp_arch_gprs.upload.tool=openocd
mbed_os_unsupp_arch_gprs.debug.tool=gdb

mbed_os_unsupp_arch_link.name=ARCH_LINK
mbed_os_unsupp_arch_link.build.mcu=-m ARCH_LINK
mbed_os_unsupp_arch_link.upload.tool=openocd
mbed_os_unsupp_arch_link.debug.tool=gdb

mbed_os_unsupp_arch_link_boot.name=ARCH_LINK_BOOT
mbed_os_unsupp_arch_link_boot.build.mcu=-m ARCH_LINK_BOOT
mbed_os_unsupp_arch_link_boot.upload.tool=openocd
mbed_os_unsupp_arch_link_boot.debug.tool=gdb

mbed_os_unsupp_arch_link_ota.name=ARCH_LINK_OTA
mbed_os_unsupp_arch_link_ota.build.mcu=-m ARCH_LINK_OTA
mbed_os_unsupp_arch_link_ota.upload.tool=openocd
mbed_os_unsupp_arch_link_ota.debug.tool=gdb

mbed_os_unsupp_arch_max.name=ARCH_MAX
mbed_os_unsupp_arch_max.build.mcu=-m ARCH_MAX
mbed_os_unsupp_arch_max.upload.tool=openocd
mbed_os_unsupp_arch_max.debug.tool=gdb

mbed_os_unsupp_arm_iotss_beid.name=ARM_IOTSS_BEID
mbed_os_unsupp_arm_iotss_beid.build.mcu=-m ARM_IOTSS_BEID
mbed_os_unsupp_arm_iotss_beid.upload.tool=openocd
mbed_os_unsupp_arm_iotss_beid.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m0.name=ARM_MPS2_M0
mbed_os_unsupp_arm_mps2_m0.build.mcu=-m ARM_MPS2_M0
mbed_os_unsupp_arm_mps2_m0.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m0.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m0p.name=ARM_MPS2_M0P
mbed_os_unsupp_arm_mps2_m0p.build.mcu=-m ARM_MPS2_M0P
mbed_os_unsupp_arm_mps2_m0p.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m0p.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m1.name=ARM_MPS2_M1
mbed_os_unsupp_arm_mps2_m1.build.mcu=-m ARM_MPS2_M1
mbed_os_unsupp_arm_mps2_m1.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m1.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m3.name=ARM_MPS2_M3
mbed_os_unsupp_arm_mps2_m3.build.mcu=-m ARM_MPS2_M3
mbed_os_unsupp_arm_mps2_m3.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m3.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m4.name=ARM_MPS2_M4
mbed_os_unsupp_arm_mps2_m4.build.mcu=-m ARM_MPS2_M4
mbed_os_unsupp_arm_mps2_m4.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m4.debug.tool=gdb

mbed_os_unsupp_arm_mps2_m7.name=ARM_MPS2_M7
mbed_os_unsupp_arm_mps2_m7.build.mcu=-m ARM_MPS2_M7
mbed_os_unsupp_arm_mps2_m7.upload.tool=openocd
mbed_os_unsupp_arm_mps2_m7.debug.tool=gdb

mbed_os_unsupp_bluepill_f103c8.name=BLUEPILL_F103C8
mbed_os_unsupp_bluepill_f103c8.build.mcu=-m BLUEPILL_F103C8
mbed_os_unsupp_bluepill_f103c8.upload.tool=openocd
mbed_os_unsupp_bluepill_f103c8.debug.tool=gdb

mbed_os_unsupp_delta_dfcm_nnn40.name=DELTA_DFCM_NNN40
mbed_os_unsupp_delta_dfcm_nnn40.build.mcu=-m DELTA_DFCM_NNN40
mbed_os_unsupp_delta_dfcm_nnn40.upload.tool=openocd
mbed_os_unsupp_delta_dfcm_nnn40.debug.tool=gdb

mbed_os_unsupp_delta_dfcm_nnn40_boot.name=DELTA_DFCM_NNN40_BOOT
mbed_os_unsupp_delta_dfcm_nnn40_boot.build.mcu=-m DELTA_DFCM_NNN40_BOOT
mbed_os_unsupp_delta_dfcm_nnn40_boot.upload.tool=openocd
mbed_os_unsupp_delta_dfcm_nnn40_boot.debug.tool=gdb

mbed_os_unsupp_delta_dfcm_nnn40_ota.name=DELTA_DFCM_NNN40_OTA
mbed_os_unsupp_delta_dfcm_nnn40_ota.build.mcu=-m DELTA_DFCM_NNN40_OTA
mbed_os_unsupp_delta_dfcm_nnn40_ota.upload.tool=openocd
mbed_os_unsupp_delta_dfcm_nnn40_ota.debug.tool=gdb

mbed_os_unsupp_disco_f051r8.name=DISCO_F051R8
mbed_os_unsupp_disco_f051r8.build.mcu=-m DISCO_F051R8
mbed_os_unsupp_disco_f051r8.upload.tool=openocd
mbed_os_unsupp_disco_f051r8.debug.tool=gdb

mbed_os_unsupp_disco_f100rb.name=DISCO_F100RB
mbed_os_unsupp_disco_f100rb.build.mcu=-m DISCO_F100RB
mbed_os_unsupp_disco_f100rb.upload.tool=openocd
mbed_os_unsupp_disco_f100rb.debug.tool=gdb

mbed_os_unsupp_disco_f303vc.name=DISCO_F303VC
mbed_os_unsupp_disco_f303vc.build.mcu=-m DISCO_F303VC
mbed_os_unsupp_disco_f303vc.upload.tool=openocd
mbed_os_unsupp_disco_f303vc.debug.tool=gdb

mbed_os_unsupp_disco_f334c8.name=DISCO_F334C8
mbed_os_unsupp_disco_f334c8.build.mcu=-m DISCO_F334C8
mbed_os_unsupp_disco_f334c8.upload.tool=openocd
mbed_os_unsupp_disco_f334c8.debug.tool=gdb

mbed_os_unsupp_disco_f401vc.name=DISCO_F401VC
mbed_os_unsupp_disco_f401vc.build.mcu=-m DISCO_F401VC
mbed_os_unsupp_disco_f401vc.upload.tool=openocd
mbed_os_unsupp_disco_f401vc.debug.tool=gdb

mbed_os_unsupp_disco_f407vg.name=DISCO_F407VG
mbed_os_unsupp_disco_f407vg.build.mcu=-m DISCO_F407VG
mbed_os_unsupp_disco_f407vg.upload.tool=openocd
mbed_os_unsupp_disco_f407vg.debug.tool=gdb

mbed_os_unsupp_disco_f769ni.name=DISCO_F769NI
mbed_os_unsupp_disco_f769ni.build.mcu=-m DISCO_F769NI
mbed_os_unsupp_disco_f769ni.upload.tool=openocd
mbed_os_unsupp_disco_f769ni.debug.tool=gdb

mbed_os_unsupp_disco_l053c8.name=DISCO_L053C8
mbed_os_unsupp_disco_l053c8.build.mcu=-m DISCO_L053C8
mbed_os_unsupp_disco_l053c8.upload.tool=openocd
mbed_os_unsupp_disco_l053c8.debug.tool=gdb

mbed_os_unsupp_efm32hg_stk3400.name=EFM32HG_STK3400
mbed_os_unsupp_efm32hg_stk3400.build.mcu=-m EFM32HG_STK3400
mbed_os_unsupp_efm32hg_stk3400.upload.tool=openocd
mbed_os_unsupp_efm32hg_stk3400.debug.tool=gdb

mbed_os_unsupp_efm32zg_stk3200.name=EFM32ZG_STK3200
mbed_os_unsupp_efm32zg_stk3200.build.mcu=-m EFM32ZG_STK3200
mbed_os_unsupp_efm32zg_stk3200.upload.tool=openocd
mbed_os_unsupp_efm32zg_stk3200.debug.tool=gdb

mbed_os_unsupp_elektor_cocorico.name=ELEKTOR_COCORICO
mbed_os_unsupp_elektor_cocorico.build.mcu=-m ELEKTOR_COCORICO
mbed_os_unsupp_elektor_cocorico.upload.tool=openocd
mbed_os_unsupp_elektor_cocorico.debug.tool=gdb

