ASoftTech/mbed.visualmicro.platform/Micro Platforms/mbed_os_52/hardware/arm-unsupported/boards.txt
mbed_os_unsupp_elmo_f411re.name=ELMO_F411RE
mbed_os_unsupp_elmo_f411re.build.mcu=-m ELMO_F411RE
mbed_os_unsupp_elmo_f411re.upload.tool=openocd
mbed_os_unsupp_elmo_f411re.debug.tool=gdb

mbed_os_unsupp_hrm1017.name=HRM1017
mbed_os_unsupp_hrm1017.build.mcu=-m HRM1017
mbed_os_unsupp_hrm1017.upload.tool=openocd
mbed_os_unsupp_hrm1017.debug.tool=gdb

mbed_os_unsupp_hrm1017_boot.name=HRM1017_BOOT
mbed_os_unsupp_hrm1017_boot.build.mcu=-m HRM1017_BOOT
mbed_os_unsupp_hrm1017_boot.upload.tool=openocd
mbed_os_unsupp_hrm1017_boot.debug.tool=gdb

mbed_os_unsupp_hrm1017_ota.name=HRM1017_OTA
mbed_os_unsupp_hrm1017_ota.build.mcu=-m HRM1017_OTA
mbed_os_unsupp_hrm1017_ota.upload.tool=openocd
mbed_os_unsupp_hrm1017_ota.debug.tool=gdb

mbed_os_unsupp_k20d50m.name=K20D50M
mbed_os_unsupp_k20d50m.build.mcu=-m K20D50M
mbed_os_unsupp_k20d50m.upload.tool=openocd
mbed_os_unsupp_k20d50m.debug.tool=gdb

mbed_os_unsupp_kl05z.name=KL05Z
mbed_os_unsupp_kl05z.build.mcu=-m KL05Z
mbed_os_unsupp_kl05z.upload.tool=openocd
mbed_os_unsupp_kl05z.debug.tool=gdb

mbed_os_unsupp_kl26z.name=KL26Z
mbed_os_unsupp_kl26z.build.mcu=-m KL26Z
mbed_os_unsupp_kl26z.upload.tool=openocd
mbed_os_unsupp_kl26z.debug.tool=gdb

mbed_os_unsupp_kl27z.name=KL27Z
mbed_os_unsupp_kl27z.build.mcu=-m KL27Z
mbed_os_unsupp_kl27z.upload.tool=openocd
mbed_os_unsupp_kl27z.debug.tool=gdb

mbed_os_unsupp_lpc1114.name=LPC1114
mbed_os_unsupp_lpc1114.build.mcu=-m LPC1114
mbed_os_unsupp_lpc1114.upload.tool=openocd
mbed_os_unsupp_lpc1114.debug.tool=gdb

mbed_os_unsupp_lpc11c24.name=LPC11C24
mbed_os_unsupp_lpc11c24.build.mcu=-m LPC11C24
mbed_os_unsupp_lpc11c24.upload.tool=openocd
mbed_os_unsupp_lpc11c24.debug.tool=gdb

mbed_os_unsupp_lpc11u24.name=LPC11U24
mbed_os_unsupp_lpc11u24.build.mcu=-m LPC11U24
mbed_os_unsupp_lpc11u24.upload.tool=openocd
mbed_os_unsupp_lpc11u24.debug.tool=gdb

mbed_os_unsupp_lpc11u24_301.name=LPC11U24_301
mbed_os_unsupp_lpc11u24_301.build.mcu=-m LPC11U24_301
mbed_os_unsupp_lpc11u24_301.upload.tool=openocd
mbed_os_unsupp_lpc11u24_301.debug.tool=gdb

mbed_os_unsupp_lpc11u34_421.name=LPC11U34_421
mbed_os_unsupp_lpc11u34_421.build.mcu=-m LPC11U34_421
mbed_os_unsupp_lpc11u34_421.upload.tool=openocd
mbed_os_unsupp_lpc11u34_421.debug.tool=gdb

mbed_os_unsupp_lpc11u35_401.name=LPC11U35_401
mbed_os_unsupp_lpc11u35_401.build.mcu=-m LPC11U35_401
mbed_os_unsupp_lpc11u35_401.upload.tool=openocd
mbed_os_unsupp_lpc11u35_401.debug.tool=gdb

mbed_os_unsupp_lpc11u35_501.name=LPC11U35_501
mbed_os_unsupp_lpc11u35_501.build.mcu=-m LPC11U35_501
mbed_os_unsupp_lpc11u35_501.upload.tool=openocd
mbed_os_unsupp_lpc11u35_501.debug.tool=gdb

mbed_os_unsupp_lpc11u35_501_ibdap.name=LPC11U35_501_IBDAP
mbed_os_unsupp_lpc11u35_501_ibdap.build.mcu=-m LPC11U35_501_IBDAP
mbed_os_unsupp_lpc11u35_501_ibdap.upload.tool=openocd
mbed_os_unsupp_lpc11u35_501_ibdap.debug.tool=gdb

mbed_os_unsupp_lpc11u35_y5_mbug.name=LPC11U35_Y5_MBUG
mbed_os_unsupp_lpc11u35_y5_mbug.build.mcu=-m LPC11U35_Y5_MBUG
mbed_os_unsupp_lpc11u35_y5_mbug.upload.tool=openocd
mbed_os_unsupp_lpc11u35_y5_mbug.debug.tool=gdb

mbed_os_unsupp_lpc11u37h_401.name=LPC11U37H_401
mbed_os_unsupp_lpc11u37h_401.build.mcu=-m LPC11U37H_401
mbed_os_unsupp_lpc11u37h_401.upload.tool=openocd
mbed_os_unsupp_lpc11u37h_401.debug.tool=gdb

mbed_os_unsupp_lpc11u37_501.name=LPC11U37_501
mbed_os_unsupp_lpc11u37_501.build.mcu=-m LPC11U37_501
mbed_os_unsupp_lpc11u37_501.upload.tool=openocd
mbed_os_unsupp_lpc11u37_501.debug.tool=gdb

mbed_os_unsupp_lpc11u68.name=LPC11U68
mbed_os_unsupp_lpc11u68.build.mcu=-m LPC11U68
mbed_os_unsupp_lpc11u68.upload.tool=openocd
mbed_os_unsupp_lpc11u68.debug.tool=gdb

mbed_os_unsupp_lpc1347.name=LPC1347
mbed_os_unsupp_lpc1347.build.mcu=-m LPC1347
mbed_os_unsupp_lpc1347.upload.tool=openocd
mbed_os_unsupp_lpc1347.debug.tool=gdb

mbed_os_unsupp_lpc1549.name=LPC1549
mbed_os_unsupp_lpc1549.build.mcu=-m LPC1549
mbed_os_unsupp_lpc1549.upload.tool=openocd
mbed_os_unsupp_lpc1549.debug.tool=gdb

mbed_os_unsupp_lpc2368.name=LPC2368
mbed_os_unsupp_lpc2368.build.mcu=-m LPC2368
mbed_os_unsupp_lpc2368.upload.tool=openocd
mbed_os_unsupp_lpc2368.debug.tool=gdb

mbed_os_unsupp_lpc2460.name=LPC2460
mbed_os_unsupp_lpc2460.build.mcu=-m LPC2460
mbed_os_unsupp_lpc2460.upload.tool=openocd
mbed_os_unsupp_lpc2460.debug.tool=gdb

mbed_os_unsupp_lpc4330_m0.name=LPC4330_M0
mbed_os_unsupp_lpc4330_m0.build.mcu=-m LPC4330_M0
mbed_os_unsupp_lpc4330_m0.upload.tool=openocd
mbed_os_unsupp_lpc4330_m0.debug.tool=gdb

mbed_os_unsupp_lpc4330_m4.name=LPC4330_M4
mbed_os_unsupp_lpc4330_m4.build.mcu=-m LPC4330_M4
mbed_os_unsupp_lpc4330_m4.upload.tool=openocd
mbed_os_unsupp_lpc4330_m4.debug.tool=gdb

mbed_os_unsupp_lpc4337.name=LPC4337
mbed_os_unsupp_lpc4337.build.mcu=-m LPC4337
mbed_os_unsupp_lpc4337.upload.tool=openocd
mbed_os_unsupp_lpc4337.debug.tool=gdb

mbed_os_unsupp_lpc810.name=LPC810
mbed_os_unsupp_lpc810.build.mcu=-m LPC810
mbed_os_unsupp_lpc810.upload.tool=openocd
mbed_os_unsupp_lpc810.debug.tool=gdb

mbed_os_unsupp_lpc812.name=LPC812
mbed_os_unsupp_lpc812.build.mcu=-m LPC812
mbed_os_unsupp_lpc812.upload.tool=openocd
mbed_os_unsupp_lpc812.debug.tool=gdb

mbed_os_unsupp_lpc824.name=LPC824
mbed_os_unsupp_lpc824.build.mcu=-m LPC824
mbed_os_unsupp_lpc824.upload.tool=openocd
mbed_os_unsupp_lpc824.debug.tool=gdb

mbed_os_unsupp_lpccappuccino.name=LPCCAPPUCCINO
mbed_os_unsupp_lpccappuccino.build.mcu=-m LPCCAPPUCCINO
mbed_os_unsupp_lpccappuccino.upload.tool=openocd
mbed_os_unsupp_lpccappuccino.debug.tool=gdb

mbed_os_unsupp_micronfcboard.name=MICRONFCBOARD
mbed_os_unsupp_micronfcboard.build.mcu=-m MICRONFCBOARD
mbed_os_unsupp_micronfcboard.upload.tool=openocd
mbed_os_unsupp_micronfcboard.debug.tool=gdb

mbed_os_unsupp_mote_l152rc.name=MOTE_L152RC
mbed_os_unsupp_mote_l152rc.build.mcu=-m MOTE_L152RC
mbed_os_unsupp_mote_l152rc.upload.tool=openocd
mbed_os_unsupp_mote_l152rc.debug.tool=gdb

mbed_os_unsupp_mtm_mtconnect04s.name=MTM_MTCONNECT04S
mbed_os_unsupp_mtm_mtconnect04s.build.mcu=-m MTM_MTCONNECT04S
mbed_os_unsupp_mtm_mtconnect04s.upload.tool=openocd
mbed_os_unsupp_mtm_mtconnect04s.debug.tool=gdb

mbed_os_unsupp_mtm_mtconnect04s_boot.name=MTM_MTCONNECT04S_BOOT
mbed_os_unsupp_mtm_mtconnect04s_boot.build.mcu=-m MTM_MTCONNECT04S_BOOT
mbed_os_unsupp_mtm_mtconnect04s_boot.upload.tool=openocd
mbed_os_unsupp_mtm_mtconnect04s_boot.debug.tool=gdb

mbed_os_unsupp_mtm_mtconnect04s_ota.name=MTM_MTCONNECT04S_OTA
mbed_os_unsupp_mtm_mtconnect04s_ota.build.mcu=-m MTM_MTCONNECT04S_OTA
mbed_os_unsupp_mtm_mtconnect04s_ota.upload.tool=openocd
mbed_os_unsupp_mtm_mtconnect04s_ota.debug.tool=gdb

mbed_os_unsupp_mts_gambit.name=MTS_GAMBIT
mbed_os_unsupp_mts_gambit.build.mcu=-m MTS_GAMBIT
mbed_os_unsupp_mts_gambit.upload.tool=openocd
mbed_os_unsupp_mts_gambit.debug.tool=gdb

mbed_os_unsupp_mts_mdot_f405rg.name=MTS_MDOT_F405RG
mbed_os_unsupp_mts_mdot_f405rg.build.mcu=-m MTS_MDOT_F405RG
mbed_os_unsupp_mts_mdot_f405rg.upload.tool=openocd
mbed_os_unsupp_mts_mdot_f405rg.debug.tool=gdb

mbed_os_unsupp_nrf51822.name=NRF51822
mbed_os_unsupp_nrf51822.build.mcu=-m NRF51822
mbed_os_unsupp_nrf51822.upload.tool=openocd
mbed_os_unsupp_nrf51822.debug.tool=gdb

mbed_os_unsupp_nrf51822_boot.name=NRF51822_BOOT
mbed_os_unsupp_nrf51822_boot.build.mcu=-m NRF51822_BOOT
mbed_os_unsupp_nrf51822_boot.upload.tool=openocd
mbed_os_unsupp_nrf51822_boot.debug.tool=gdb

