ASoftTech/mbed.visualmicro.platform/Micro Platforms/mbed_os_52/hardware/arm-unsupported/boards.txt
mbed_os_unsupp_nrf51822_ota.name=NRF51822_OTA
mbed_os_unsupp_nrf51822_ota.build.mcu=-m NRF51822_OTA
mbed_os_unsupp_nrf51822_ota.upload.tool=openocd
mbed_os_unsupp_nrf51822_ota.debug.tool=gdb

mbed_os_unsupp_nrf51822_y5_mbug.name=NRF51822_Y5_MBUG
mbed_os_unsupp_nrf51822_y5_mbug.build.mcu=-m NRF51822_Y5_MBUG
mbed_os_unsupp_nrf51822_y5_mbug.upload.tool=openocd
mbed_os_unsupp_nrf51822_y5_mbug.debug.tool=gdb

mbed_os_unsupp_nrf51_dk_boot.name=NRF51_DK_BOOT
mbed_os_unsupp_nrf51_dk_boot.build.mcu=-m NRF51_DK_BOOT
mbed_os_unsupp_nrf51_dk_boot.upload.tool=openocd
mbed_os_unsupp_nrf51_dk_boot.debug.tool=gdb

mbed_os_unsupp_nrf51_dk_legacy.name=NRF51_DK_LEGACY
mbed_os_unsupp_nrf51_dk_legacy.build.mcu=-m NRF51_DK_LEGACY
mbed_os_unsupp_nrf51_dk_legacy.upload.tool=openocd
mbed_os_unsupp_nrf51_dk_legacy.debug.tool=gdb

mbed_os_unsupp_nrf51_dk_ota.name=NRF51_DK_OTA
mbed_os_unsupp_nrf51_dk_ota.build.mcu=-m NRF51_DK_OTA
mbed_os_unsupp_nrf51_dk_ota.upload.tool=openocd
mbed_os_unsupp_nrf51_dk_ota.debug.tool=gdb

mbed_os_unsupp_nrf51_dongle_boot.name=NRF51_DONGLE_BOOT
mbed_os_unsupp_nrf51_dongle_boot.build.mcu=-m NRF51_DONGLE_BOOT
mbed_os_unsupp_nrf51_dongle_boot.upload.tool=openocd
mbed_os_unsupp_nrf51_dongle_boot.debug.tool=gdb

mbed_os_unsupp_nrf51_dongle_legacy.name=NRF51_DONGLE_LEGACY
mbed_os_unsupp_nrf51_dongle_legacy.build.mcu=-m NRF51_DONGLE_LEGACY
mbed_os_unsupp_nrf51_dongle_legacy.upload.tool=openocd
mbed_os_unsupp_nrf51_dongle_legacy.debug.tool=gdb

mbed_os_unsupp_nrf51_dongle_ota.name=NRF51_DONGLE_OTA
mbed_os_unsupp_nrf51_dongle_ota.build.mcu=-m NRF51_DONGLE_OTA
mbed_os_unsupp_nrf51_dongle_ota.upload.tool=openocd
mbed_os_unsupp_nrf51_dongle_ota.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit.name=NRF51_MICROBIT
mbed_os_unsupp_nrf51_microbit.build.mcu=-m NRF51_MICROBIT
mbed_os_unsupp_nrf51_microbit.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit_b.name=NRF51_MICROBIT_B
mbed_os_unsupp_nrf51_microbit_b.build.mcu=-m NRF51_MICROBIT_B
mbed_os_unsupp_nrf51_microbit_b.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit_b.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit_boot.name=NRF51_MICROBIT_BOOT
mbed_os_unsupp_nrf51_microbit_boot.build.mcu=-m NRF51_MICROBIT_BOOT
mbed_os_unsupp_nrf51_microbit_boot.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit_boot.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit_b_boot.name=NRF51_MICROBIT_B_BOOT
mbed_os_unsupp_nrf51_microbit_b_boot.build.mcu=-m NRF51_MICROBIT_B_BOOT
mbed_os_unsupp_nrf51_microbit_b_boot.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit_b_boot.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit_b_ota.name=NRF51_MICROBIT_B_OTA
mbed_os_unsupp_nrf51_microbit_b_ota.build.mcu=-m NRF51_MICROBIT_B_OTA
mbed_os_unsupp_nrf51_microbit_b_ota.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit_b_ota.debug.tool=gdb

mbed_os_unsupp_nrf51_microbit_ota.name=NRF51_MICROBIT_OTA
mbed_os_unsupp_nrf51_microbit_ota.build.mcu=-m NRF51_MICROBIT_OTA
mbed_os_unsupp_nrf51_microbit_ota.upload.tool=openocd
mbed_os_unsupp_nrf51_microbit_ota.debug.tool=gdb

mbed_os_unsupp_nucleo_f030r8.name=NUCLEO_F030R8
mbed_os_unsupp_nucleo_f030r8.build.mcu=-m NUCLEO_F030R8
mbed_os_unsupp_nucleo_f030r8.upload.tool=openocd
mbed_os_unsupp_nucleo_f030r8.debug.tool=gdb

mbed_os_unsupp_nucleo_f031k6.name=NUCLEO_F031K6
mbed_os_unsupp_nucleo_f031k6.build.mcu=-m NUCLEO_F031K6
mbed_os_unsupp_nucleo_f031k6.upload.tool=openocd
mbed_os_unsupp_nucleo_f031k6.debug.tool=gdb

mbed_os_unsupp_nucleo_f042k6.name=NUCLEO_F042K6
mbed_os_unsupp_nucleo_f042k6.build.mcu=-m NUCLEO_F042K6
mbed_os_unsupp_nucleo_f042k6.upload.tool=openocd
mbed_os_unsupp_nucleo_f042k6.debug.tool=gdb

mbed_os_unsupp_nucleo_f302r8.name=NUCLEO_F302R8
mbed_os_unsupp_nucleo_f302r8.build.mcu=-m NUCLEO_F302R8
mbed_os_unsupp_nucleo_f302r8.upload.tool=openocd
mbed_os_unsupp_nucleo_f302r8.debug.tool=gdb

mbed_os_unsupp_nucleo_f303k8.name=NUCLEO_F303K8
mbed_os_unsupp_nucleo_f303k8.build.mcu=-m NUCLEO_F303K8
mbed_os_unsupp_nucleo_f303k8.upload.tool=openocd
mbed_os_unsupp_nucleo_f303k8.debug.tool=gdb

mbed_os_unsupp_nucleo_f334r8.name=NUCLEO_F334R8
mbed_os_unsupp_nucleo_f334r8.build.mcu=-m NUCLEO_F334R8
mbed_os_unsupp_nucleo_f334r8.upload.tool=openocd
mbed_os_unsupp_nucleo_f334r8.debug.tool=gdb

mbed_os_unsupp_nucleo_l011k4.name=NUCLEO_L011K4
mbed_os_unsupp_nucleo_l011k4.build.mcu=-m NUCLEO_L011K4
mbed_os_unsupp_nucleo_l011k4.upload.tool=openocd
mbed_os_unsupp_nucleo_l011k4.debug.tool=gdb

mbed_os_unsupp_nucleo_l031k6.name=NUCLEO_L031K6
mbed_os_unsupp_nucleo_l031k6.build.mcu=-m NUCLEO_L031K6
mbed_os_unsupp_nucleo_l031k6.upload.tool=openocd
mbed_os_unsupp_nucleo_l031k6.debug.tool=gdb

mbed_os_unsupp_nucleo_l053r8.name=NUCLEO_L053R8
mbed_os_unsupp_nucleo_l053r8.build.mcu=-m NUCLEO_L053R8
mbed_os_unsupp_nucleo_l053r8.upload.tool=openocd
mbed_os_unsupp_nucleo_l053r8.debug.tool=gdb

mbed_os_unsupp_nz32_sc151.name=NZ32_SC151
mbed_os_unsupp_nz32_sc151.build.mcu=-m NZ32_SC151
mbed_os_unsupp_nz32_sc151.upload.tool=openocd
mbed_os_unsupp_nz32_sc151.debug.tool=gdb

mbed_os_unsupp_oc_mbuino.name=OC_MBUINO
mbed_os_unsupp_oc_mbuino.build.mcu=-m OC_MBUINO
mbed_os_unsupp_oc_mbuino.upload.tool=openocd
mbed_os_unsupp_oc_mbuino.debug.tool=gdb

mbed_os_unsupp_rblab_blenano.name=RBLAB_BLENANO
mbed_os_unsupp_rblab_blenano.build.mcu=-m RBLAB_BLENANO
mbed_os_unsupp_rblab_blenano.upload.tool=openocd
mbed_os_unsupp_rblab_blenano.debug.tool=gdb

mbed_os_unsupp_rblab_blenano_boot.name=RBLAB_BLENANO_BOOT
mbed_os_unsupp_rblab_blenano_boot.build.mcu=-m RBLAB_BLENANO_BOOT
mbed_os_unsupp_rblab_blenano_boot.upload.tool=openocd
mbed_os_unsupp_rblab_blenano_boot.debug.tool=gdb

mbed_os_unsupp_rblab_blenano_ota.name=RBLAB_BLENANO_OTA
mbed_os_unsupp_rblab_blenano_ota.build.mcu=-m RBLAB_BLENANO_OTA
mbed_os_unsupp_rblab_blenano_ota.upload.tool=openocd
mbed_os_unsupp_rblab_blenano_ota.debug.tool=gdb

mbed_os_unsupp_rblab_nrf51822.name=RBLAB_NRF51822
mbed_os_unsupp_rblab_nrf51822.build.mcu=-m RBLAB_NRF51822
mbed_os_unsupp_rblab_nrf51822.upload.tool=openocd
mbed_os_unsupp_rblab_nrf51822.debug.tool=gdb

mbed_os_unsupp_rblab_nrf51822_boot.name=RBLAB_NRF51822_BOOT
mbed_os_unsupp_rblab_nrf51822_boot.build.mcu=-m RBLAB_NRF51822_BOOT
mbed_os_unsupp_rblab_nrf51822_boot.upload.tool=openocd
mbed_os_unsupp_rblab_nrf51822_boot.debug.tool=gdb

mbed_os_unsupp_rblab_nrf51822_ota.name=RBLAB_NRF51822_OTA
mbed_os_unsupp_rblab_nrf51822_ota.build.mcu=-m RBLAB_NRF51822_OTA
mbed_os_unsupp_rblab_nrf51822_ota.upload.tool=openocd
mbed_os_unsupp_rblab_nrf51822_ota.debug.tool=gdb

mbed_os_unsupp_samd21g18a.name=SAMD21G18A
mbed_os_unsupp_samd21g18a.build.mcu=-m SAMD21G18A
mbed_os_unsupp_samd21g18a.upload.tool=openocd
mbed_os_unsupp_samd21g18a.debug.tool=gdb

mbed_os_unsupp_samd21j18a.name=SAMD21J18A
mbed_os_unsupp_samd21j18a.build.mcu=-m SAMD21J18A
mbed_os_unsupp_samd21j18a.upload.tool=openocd
mbed_os_unsupp_samd21j18a.debug.tool=gdb

mbed_os_unsupp_samg55j19.name=SAMG55J19
mbed_os_unsupp_samg55j19.build.mcu=-m SAMG55J19
mbed_os_unsupp_samg55j19.upload.tool=openocd
mbed_os_unsupp_samg55j19.debug.tool=gdb

mbed_os_unsupp_saml21j18a.name=SAML21J18A
mbed_os_unsupp_saml21j18a.build.mcu=-m SAML21J18A
mbed_os_unsupp_saml21j18a.upload.tool=openocd
mbed_os_unsupp_saml21j18a.debug.tool=gdb

mbed_os_unsupp_samr21g18a.name=SAMR21G18A
mbed_os_unsupp_samr21g18a.build.mcu=-m SAMR21G18A
mbed_os_unsupp_samr21g18a.upload.tool=openocd
mbed_os_unsupp_samr21g18a.debug.tool=gdb

mbed_os_unsupp_seeed_tiny_ble.name=SEEED_TINY_BLE
mbed_os_unsupp_seeed_tiny_ble.build.mcu=-m SEEED_TINY_BLE
mbed_os_unsupp_seeed_tiny_ble.upload.tool=openocd
mbed_os_unsupp_seeed_tiny_ble.debug.tool=gdb

mbed_os_unsupp_seeed_tiny_ble_boot.name=SEEED_TINY_BLE_BOOT
mbed_os_unsupp_seeed_tiny_ble_boot.build.mcu=-m SEEED_TINY_BLE_BOOT
mbed_os_unsupp_seeed_tiny_ble_boot.upload.tool=openocd
mbed_os_unsupp_seeed_tiny_ble_boot.debug.tool=gdb

mbed_os_unsupp_seeed_tiny_ble_ota.name=SEEED_TINY_BLE_OTA
mbed_os_unsupp_seeed_tiny_ble_ota.build.mcu=-m SEEED_TINY_BLE_OTA
mbed_os_unsupp_seeed_tiny_ble_ota.upload.tool=openocd
mbed_os_unsupp_seeed_tiny_ble_ota.debug.tool=gdb

mbed_os_unsupp_ssci824.name=SSCI824
mbed_os_unsupp_ssci824.build.mcu=-m SSCI824
mbed_os_unsupp_ssci824.upload.tool=openocd
mbed_os_unsupp_ssci824.debug.tool=gdb

