ASoftTech/mbed.visualmicro.platform/Micro Platforms/mbed_os_52/hardware/arm-unsupported/boards.txt
mbed_os_unsupp_stm32f3xx.name=STM32F3XX
mbed_os_unsupp_stm32f3xx.build.mcu=-m STM32F3XX
mbed_os_unsupp_stm32f3xx.upload.tool=openocd
mbed_os_unsupp_stm32f3xx.debug.tool=gdb

mbed_os_unsupp_stm32f407.name=STM32F407
mbed_os_unsupp_stm32f407.build.mcu=-m STM32F407
mbed_os_unsupp_stm32f407.upload.tool=openocd
mbed_os_unsupp_stm32f407.debug.tool=gdb

mbed_os_unsupp_super_target.name=Super_Target
mbed_os_unsupp_super_target.build.mcu=-m Super_Target
mbed_os_unsupp_super_target.upload.tool=openocd
mbed_os_unsupp_super_target.debug.tool=gdb

mbed_os_unsupp_teensy3_1.name=TEENSY3_1
mbed_os_unsupp_teensy3_1.build.mcu=-m TEENSY3_1
mbed_os_unsupp_teensy3_1.upload.tool=openocd
mbed_os_unsupp_teensy3_1.debug.tool=gdb

mbed_os_unsupp_ty51822r3_boot.name=TY51822R3_BOOT
mbed_os_unsupp_ty51822r3_boot.build.mcu=-m TY51822R3_BOOT
mbed_os_unsupp_ty51822r3_boot.upload.tool=openocd
mbed_os_unsupp_ty51822r3_boot.debug.tool=gdb

mbed_os_unsupp_ty51822r3_ota.name=TY51822R3_OTA
mbed_os_unsupp_ty51822r3_ota.build.mcu=-m TY51822R3_OTA
mbed_os_unsupp_ty51822r3_ota.upload.tool=openocd
mbed_os_unsupp_ty51822r3_ota.debug.tool=gdb

mbed_os_unsupp_wallbot_ble.name=WALLBOT_BLE
mbed_os_unsupp_wallbot_ble.build.mcu=-m WALLBOT_BLE
mbed_os_unsupp_wallbot_ble.upload.tool=openocd
mbed_os_unsupp_wallbot_ble.debug.tool=gdb

mbed_os_unsupp_wallbot_ble_boot.name=WALLBOT_BLE_BOOT
mbed_os_unsupp_wallbot_ble_boot.build.mcu=-m WALLBOT_BLE_BOOT
mbed_os_unsupp_wallbot_ble_boot.upload.tool=openocd
mbed_os_unsupp_wallbot_ble_boot.debug.tool=gdb

mbed_os_unsupp_wallbot_ble_ota.name=WALLBOT_BLE_OTA
mbed_os_unsupp_wallbot_ble_ota.build.mcu=-m WALLBOT_BLE_OTA
mbed_os_unsupp_wallbot_ble_ota.upload.tool=openocd
mbed_os_unsupp_wallbot_ble_ota.debug.tool=gdb

mbed_os_unsupp_wizwiki_w7500.name=WIZWIKI_W7500
mbed_os_unsupp_wizwiki_w7500.build.mcu=-m WIZWIKI_W7500
mbed_os_unsupp_wizwiki_w7500.upload.tool=openocd
mbed_os_unsupp_wizwiki_w7500.debug.tool=gdb

mbed_os_unsupp_wizwiki_w7500eco.name=WIZWIKI_W7500ECO
mbed_os_unsupp_wizwiki_w7500eco.build.mcu=-m WIZWIKI_W7500ECO
mbed_os_unsupp_wizwiki_w7500eco.upload.tool=openocd
mbed_os_unsupp_wizwiki_w7500eco.debug.tool=gdb

mbed_os_unsupp_wizwiki_w7500p.name=WIZWIKI_W7500P
mbed_os_unsupp_wizwiki_w7500p.build.mcu=-m WIZWIKI_W7500P
mbed_os_unsupp_wizwiki_w7500p.upload.tool=openocd
mbed_os_unsupp_wizwiki_w7500p.debug.tool=gdb

mbed_os_unsupp_xadow_m0.name=XADOW_M0
mbed_os_unsupp_xadow_m0.build.mcu=-m XADOW_M0
mbed_os_unsupp_xadow_m0.upload.tool=openocd
mbed_os_unsupp_xadow_m0.debug.tool=gdb

mbed_os_unsupp_xbed_lpc1768.name=XBED_LPC1768
mbed_os_unsupp_xbed_lpc1768.build.mcu=-m XBED_LPC1768
mbed_os_unsupp_xbed_lpc1768.upload.tool=openocd
mbed_os_unsupp_xbed_lpc1768.debug.tool=gdb

